hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_enet_regs.h
/*
 * VTFE (RW)
 *
 * VLAN Tag Filter Enable
 *  When set, this bit enables the MAC to drop VLAN tagged frames that do not match the VLAN Tag comparison.
 * When reset, the MAC forwards all frames irrespective of the match status of the VLAN Tag.
 */
#define ENET_MACFF_VTFE_MASK (0x8000U)
#define ENET_MACFF_VTFE_SHIFT (15U)
#define ENET_MACFF_VTFE_SET(x) (((uint32_t)(x) << ENET_MACFF_VTFE_SHIFT) & ENET_MACFF_VTFE_MASK)
#define ENET_MACFF_VTFE_GET(x) (((uint32_t)(x) & ENET_MACFF_VTFE_MASK) >> ENET_MACFF_VTFE_SHIFT)

/*
 * HPF (RW)
 *
 * Hash or Perfect Filter
 *  When this bit is set, it configures the address filter to pass a frame if it matches either the perfect filtering or the hash filtering as set by the HMC or HUC bits.
 * When this bit is low and the HUC or HMC bit is set, the frame is passed only if it matches the Hash filter.
 */
#define ENET_MACFF_HPF_MASK (0x400U)
#define ENET_MACFF_HPF_SHIFT (10U)
#define ENET_MACFF_HPF_SET(x) (((uint32_t)(x) << ENET_MACFF_HPF_SHIFT) & ENET_MACFF_HPF_MASK)
#define ENET_MACFF_HPF_GET(x) (((uint32_t)(x) & ENET_MACFF_HPF_MASK) >> ENET_MACFF_HPF_SHIFT)

/*
 * SAF (RW)
 *
 * Source Address Filter Enable
 *  When this bit is set, the MAC compares the SA field of the received frames with the values programmed in the enabled SA registers. If the comparison fails,
 *  the MAC drops the frame. When this bit is reset, the MAC forwards the received frame to the application with updated SAF bit of the Rx Status depending on the SA address comparison.
 */
#define ENET_MACFF_SAF_MASK (0x200U)
#define ENET_MACFF_SAF_SHIFT (9U)
#define ENET_MACFF_SAF_SET(x) (((uint32_t)(x) << ENET_MACFF_SAF_SHIFT) & ENET_MACFF_SAF_MASK)
#define ENET_MACFF_SAF_GET(x) (((uint32_t)(x) & ENET_MACFF_SAF_MASK) >> ENET_MACFF_SAF_SHIFT)

/*
 * SAIF (RW)
 *
 * SA Inverse Filtering
 * When this bit is set, the Address Check block operates in inverse filtering mode for the SA address comparison. The frames whose SA matches the SA registers are marked as failing the SA Address filter.
 * When this bit is reset, frames whose SA does not match the SA registers are marked as failing the SA Address filter.
 */
#define ENET_MACFF_SAIF_MASK (0x100U)
#define ENET_MACFF_SAIF_SHIFT (8U)
#define ENET_MACFF_SAIF_SET(x) (((uint32_t)(x) << ENET_MACFF_SAIF_SHIFT) & ENET_MACFF_SAIF_MASK)
#define ENET_MACFF_SAIF_GET(x) (((uint32_t)(x) & ENET_MACFF_SAIF_MASK) >> ENET_MACFF_SAIF_SHIFT)

/*
 * PCF (RW)
 *
 * Pass Control Frames
 *  These bits control the forwarding of all control frames (including unicast and multicast Pause frames).
 * - 00: MAC filters all control frames from reaching the application.
 * - 01: MAC forwards all control frames except Pause frames to application even if they fail the Address filter.
 * - 10: MAC forwards all control frames to application even if they fail the Address Filter.
 * - 11: MAC forwards control frames that pass the Address Filter.
 * The following conditions should be true for the Pause frames processing:
 * - Condition 1: The MAC is in the full-duplex mode and flow control is enabled by setting Bit 2 (RFE) of Register 6 (Flow Control Register) to 1.
 * - Condition 2: The destination address (DA) of the received frame matches the special multicast address or the MAC Address 0 when Bit 3 (UP) of the Register 6 (Flow Control Register) is set.
 * - Condition 3: The Type field of the received frame is 0x8808 and the OPCODE field is 0x0001.
 * Note: This field should be set to 01 only when the Condition 1 is true,
 * that is, the MAC is programmed to operate in the full-duplex mode and the RFE bit is enabled.
 * Otherwise, the Pause frame filtering may be inconsistent.
 * When Condition 1 is false, the Pause frames are considered as generic control frames.
 * Therefore, to pass all control frames (including Pause frames) when the full-duplex mode and flow control is not enabled,
 * you should set the PCF field to 10 or 11 (as required by the application).
 */
#define ENET_MACFF_PCF_MASK (0xC0U)
#define ENET_MACFF_PCF_SHIFT (6U)
#define ENET_MACFF_PCF_SET(x) (((uint32_t)(x) << ENET_MACFF_PCF_SHIFT) & ENET_MACFF_PCF_MASK)
#define ENET_MACFF_PCF_GET(x) (((uint32_t)(x) & ENET_MACFF_PCF_MASK) >> ENET_MACFF_PCF_SHIFT)

/*
 * DBF (RW)
 *
 * Disable Broadcast Frames
 *  When this bit is set, the AFM module blocks all incoming broadcast frames. In addition, it overrides all other filter settings.
 * When this bit is reset, the AFM module passes all received broadcast frames.
 */
#define ENET_MACFF_DBF_MASK (0x20U)
#define ENET_MACFF_DBF_SHIFT (5U)
#define ENET_MACFF_DBF_SET(x) (((uint32_t)(x) << ENET_MACFF_DBF_SHIFT) & ENET_MACFF_DBF_MASK)
#define ENET_MACFF_DBF_GET(x) (((uint32_t)(x) & ENET_MACFF_DBF_MASK) >> ENET_MACFF_DBF_SHIFT)

/*
 * PM (RW)
 *
 * Pass All Multicast
 * When set, this bit indicates that all received frames with a multicast destination address (first bit in the destination address field is '1') are passed.
 * When reset, filtering of multicast frame depends on HMC bit.
 */
#define ENET_MACFF_PM_MASK (0x10U)
#define ENET_MACFF_PM_SHIFT (4U)
#define ENET_MACFF_PM_SET(x) (((uint32_t)(x) << ENET_MACFF_PM_SHIFT) & ENET_MACFF_PM_MASK)
#define ENET_MACFF_PM_GET(x) (((uint32_t)(x) & ENET_MACFF_PM_MASK) >> ENET_MACFF_PM_SHIFT)

/*
 * DAIF (RW)
 *
 * DA Inverse Filtering
 *  When this bit is set, the Address Check block operates in inverse filtering mode for the DA address comparison for both unicast and multicast frames.
 * When reset, normal filtering of frames is performed.
 */
#define ENET_MACFF_DAIF_MASK (0x8U)
#define ENET_MACFF_DAIF_SHIFT (3U)
#define ENET_MACFF_DAIF_SET(x) (((uint32_t)(x) << ENET_MACFF_DAIF_SHIFT) & ENET_MACFF_DAIF_MASK)
#define ENET_MACFF_DAIF_GET(x) (((uint32_t)(x) & ENET_MACFF_DAIF_MASK) >> ENET_MACFF_DAIF_SHIFT)

/*
 * HMC (RW)
 *
 * Hash Multicast
 * When set, the MAC performs destination address filtering of received multicast frames according to the hash table. When reset,
 * the MAC performs a perfect destination address filtering for multicast frames, that is, it compares the DA field with the values programmed in DA registers.
 */
#define ENET_MACFF_HMC_MASK (0x4U)
#define ENET_MACFF_HMC_SHIFT (2U)
#define ENET_MACFF_HMC_SET(x) (((uint32_t)(x) << ENET_MACFF_HMC_SHIFT) & ENET_MACFF_HMC_MASK)
#define ENET_MACFF_HMC_GET(x) (((uint32_t)(x) & ENET_MACFF_HMC_MASK) >> ENET_MACFF_HMC_SHIFT)

