hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_enet_regs.h
/*
 * TXVLANGFIM (RW)
 *
 * MMC Transmit VLAN Good Frame Counter Interrupt Mask
 * Setting this bit masks the interrupt when the txvlanframes_g counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_MASK_TX_TXVLANGFIM_MASK (0x1000000UL)
#define ENET_MMC_INTR_MASK_TX_TXVLANGFIM_SHIFT (24U)
#define ENET_MMC_INTR_MASK_TX_TXVLANGFIM_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_MASK_TX_TXVLANGFIM_SHIFT) & ENET_MMC_INTR_MASK_TX_TXVLANGFIM_MASK)
#define ENET_MMC_INTR_MASK_TX_TXVLANGFIM_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_MASK_TX_TXVLANGFIM_MASK) >> ENET_MMC_INTR_MASK_TX_TXVLANGFIM_SHIFT)

/*
 * TXPAUSFIM (RW)
 *
 * MMC Transmit Pause Frame Counter Interrupt Mask
 * Setting this bit masks the interrupt when the txpauseframes counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_MASK_TX_TXPAUSFIM_MASK (0x800000UL)
#define ENET_MMC_INTR_MASK_TX_TXPAUSFIM_SHIFT (23U)
#define ENET_MMC_INTR_MASK_TX_TXPAUSFIM_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_MASK_TX_TXPAUSFIM_SHIFT) & ENET_MMC_INTR_MASK_TX_TXPAUSFIM_MASK)
#define ENET_MMC_INTR_MASK_TX_TXPAUSFIM_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_MASK_TX_TXPAUSFIM_MASK) >> ENET_MMC_INTR_MASK_TX_TXPAUSFIM_SHIFT)

/*
 * TXEXDEFFIM (RW)
 *
 * MMC Transmit Excessive Deferral Frame Counter Interrupt Mask
 * Setting this bit masks the interrupt when the txexcessdef counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_MASK_TX_TXEXDEFFIM_MASK (0x400000UL)
#define ENET_MMC_INTR_MASK_TX_TXEXDEFFIM_SHIFT (22U)
#define ENET_MMC_INTR_MASK_TX_TXEXDEFFIM_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_MASK_TX_TXEXDEFFIM_SHIFT) & ENET_MMC_INTR_MASK_TX_TXEXDEFFIM_MASK)
#define ENET_MMC_INTR_MASK_TX_TXEXDEFFIM_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_MASK_TX_TXEXDEFFIM_MASK) >> ENET_MMC_INTR_MASK_TX_TXEXDEFFIM_SHIFT)

/*
 * TXGFRMIM (RW)
 *
 * MMC Transmit Good Frame Counter Interrupt Mask
 * Setting this bit masks the interrupt when the txframecount_g counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_MASK_TX_TXGFRMIM_MASK (0x200000UL)
#define ENET_MMC_INTR_MASK_TX_TXGFRMIM_SHIFT (21U)
#define ENET_MMC_INTR_MASK_TX_TXGFRMIM_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_MASK_TX_TXGFRMIM_SHIFT) & ENET_MMC_INTR_MASK_TX_TXGFRMIM_MASK)
#define ENET_MMC_INTR_MASK_TX_TXGFRMIM_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_MASK_TX_TXGFRMIM_MASK) >> ENET_MMC_INTR_MASK_TX_TXGFRMIM_SHIFT)

/*
 * TXGOCTIM (RW)
 *
 * MMC Transmit Good Octet Counter Interrupt Mask
 * Setting this bit masks the interrupt when the txoctetcount_g counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_MASK_TX_TXGOCTIM_MASK (0x100000UL)
#define ENET_MMC_INTR_MASK_TX_TXGOCTIM_SHIFT (20U)
#define ENET_MMC_INTR_MASK_TX_TXGOCTIM_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_MASK_TX_TXGOCTIM_SHIFT) & ENET_MMC_INTR_MASK_TX_TXGOCTIM_MASK)
#define ENET_MMC_INTR_MASK_TX_TXGOCTIM_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_MASK_TX_TXGOCTIM_MASK) >> ENET_MMC_INTR_MASK_TX_TXGOCTIM_SHIFT)

/*
 * TXCARERFIM (RW)
 *
 * MMC Transmit Carrier Error Frame Counter Interrupt Mask
 * Setting this bit masks the interrupt when the txcarriererror counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_MASK_TX_TXCARERFIM_MASK (0x80000UL)
#define ENET_MMC_INTR_MASK_TX_TXCARERFIM_SHIFT (19U)
#define ENET_MMC_INTR_MASK_TX_TXCARERFIM_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_MASK_TX_TXCARERFIM_SHIFT) & ENET_MMC_INTR_MASK_TX_TXCARERFIM_MASK)
#define ENET_MMC_INTR_MASK_TX_TXCARERFIM_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_MASK_TX_TXCARERFIM_MASK) >> ENET_MMC_INTR_MASK_TX_TXCARERFIM_SHIFT)

/*
 * TXEXCOLFIM (RW)
 *
 * MMC Transmit Excessive Collision Frame Counter Interrupt Mask
 * Setting this bit masks the interrupt when the txexcesscol counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_MASK_TX_TXEXCOLFIM_MASK (0x40000UL)
#define ENET_MMC_INTR_MASK_TX_TXEXCOLFIM_SHIFT (18U)
#define ENET_MMC_INTR_MASK_TX_TXEXCOLFIM_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_MASK_TX_TXEXCOLFIM_SHIFT) & ENET_MMC_INTR_MASK_TX_TXEXCOLFIM_MASK)
#define ENET_MMC_INTR_MASK_TX_TXEXCOLFIM_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_MASK_TX_TXEXCOLFIM_MASK) >> ENET_MMC_INTR_MASK_TX_TXEXCOLFIM_SHIFT)

/*
 * TXLATCOLFIM (RW)
 *
 * MMC Transmit Late Collision Frame Counter Interrupt Mask
 * Setting this bit masks the interrupt when the txlatecol counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_MASK_TX_TXLATCOLFIM_MASK (0x20000UL)
#define ENET_MMC_INTR_MASK_TX_TXLATCOLFIM_SHIFT (17U)
#define ENET_MMC_INTR_MASK_TX_TXLATCOLFIM_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_MASK_TX_TXLATCOLFIM_SHIFT) & ENET_MMC_INTR_MASK_TX_TXLATCOLFIM_MASK)
#define ENET_MMC_INTR_MASK_TX_TXLATCOLFIM_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_MASK_TX_TXLATCOLFIM_MASK) >> ENET_MMC_INTR_MASK_TX_TXLATCOLFIM_SHIFT)

/*
 * TXDEFFIM (RW)
 *
 * MMC Transmit Deferred Frame Counter Interrupt Mask
 * Setting this bit masks the interrupt when the txdeferred counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_MASK_TX_TXDEFFIM_MASK (0x10000UL)
#define ENET_MMC_INTR_MASK_TX_TXDEFFIM_SHIFT (16U)
#define ENET_MMC_INTR_MASK_TX_TXDEFFIM_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_MASK_TX_TXDEFFIM_SHIFT) & ENET_MMC_INTR_MASK_TX_TXDEFFIM_MASK)
#define ENET_MMC_INTR_MASK_TX_TXDEFFIM_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_MASK_TX_TXDEFFIM_MASK) >> ENET_MMC_INTR_MASK_TX_TXDEFFIM_SHIFT)

/*
 * TXMCOLGFIM (RW)
 *
 * MMC Transmit Multiple Collision Good Frame Counter Interrupt Mask
 * Setting this bit masks the interrupt when the txmulticol_g counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_MASK_TX_TXMCOLGFIM_MASK (0x8000U)
#define ENET_MMC_INTR_MASK_TX_TXMCOLGFIM_SHIFT (15U)
#define ENET_MMC_INTR_MASK_TX_TXMCOLGFIM_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_MASK_TX_TXMCOLGFIM_SHIFT) & ENET_MMC_INTR_MASK_TX_TXMCOLGFIM_MASK)
#define ENET_MMC_INTR_MASK_TX_TXMCOLGFIM_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_MASK_TX_TXMCOLGFIM_MASK) >> ENET_MMC_INTR_MASK_TX_TXMCOLGFIM_SHIFT)

