hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_enet_regs.h
/* Bitfield definition for register: MMC_IPC_INTR_RX */
/*
 * RXIPV4GFIS (RW)
 *
 * MMC Receive IPV4 Good Frame Counter Interrupt Status
 * This bit is set when the rxipv4_gd_frms counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_RX_RXIPV4GFIS_MASK (0x1U)
#define ENET_MMC_IPC_INTR_RX_RXIPV4GFIS_SHIFT (0U)
#define ENET_MMC_IPC_INTR_RX_RXIPV4GFIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXIPV4GFIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXIPV4GFIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXIPV4GFIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXIPV4GFIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXIPV4GFIS_SHIFT)

/* Bitfield definition for register: RXIPV4_GD_FMS */
/*
 * FRMCNT (RW)
 *
 * Number of good IPv4 datagrams received with the TCP, UDP, or ICMP payload
 */
#define ENET_RXIPV4_GD_FMS_FRMCNT_MASK (0xFFFFFFFFUL)
#define ENET_RXIPV4_GD_FMS_FRMCNT_SHIFT (0U)
#define ENET_RXIPV4_GD_FMS_FRMCNT_SET(x) (((uint32_t)(x) << ENET_RXIPV4_GD_FMS_FRMCNT_SHIFT) & ENET_RXIPV4_GD_FMS_FRMCNT_MASK)
#define ENET_RXIPV4_GD_FMS_FRMCNT_GET(x) (((uint32_t)(x) & ENET_RXIPV4_GD_FMS_FRMCNT_MASK) >> ENET_RXIPV4_GD_FMS_FRMCNT_SHIFT)

/* Bitfield definition for register of struct array L3_L4_CFG: L3_L4_CTRL */
/*
 * L4DPIM0 (RW)
 *
 * Layer 4 Destination Port Inverse Match Enable
 *  When set, this bit indicates that the Layer 4 Destination Port number field is enabled for inverse matching.
 * When reset, this bit indicates that the Layer 4 Destination Port number field is enabled for perfect matching.
 *  This bit is valid and applicable only when Bit 20 (L4DPM0) is set high.
 */
#define ENET_L3_L4_CFG_L3_L4_CTRL_L4DPIM0_MASK (0x200000UL)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L4DPIM0_SHIFT (21U)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L4DPIM0_SET(x) (((uint32_t)(x) << ENET_L3_L4_CFG_L3_L4_CTRL_L4DPIM0_SHIFT) & ENET_L3_L4_CFG_L3_L4_CTRL_L4DPIM0_MASK)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L4DPIM0_GET(x) (((uint32_t)(x) & ENET_L3_L4_CFG_L3_L4_CTRL_L4DPIM0_MASK) >> ENET_L3_L4_CFG_L3_L4_CTRL_L4DPIM0_SHIFT)

/*
 * L4DPM0 (RW)
 *
 * Layer 4 Destination Port Match Enable
 *  When set, this bit indicates that the Layer 4 Destination Port number field is enabled for matching.
 * When reset, the MAC ignores the Layer 4 Destination Port number field for matching.
 */
#define ENET_L3_L4_CFG_L3_L4_CTRL_L4DPM0_MASK (0x100000UL)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L4DPM0_SHIFT (20U)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L4DPM0_SET(x) (((uint32_t)(x) << ENET_L3_L4_CFG_L3_L4_CTRL_L4DPM0_SHIFT) & ENET_L3_L4_CFG_L3_L4_CTRL_L4DPM0_MASK)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L4DPM0_GET(x) (((uint32_t)(x) & ENET_L3_L4_CFG_L3_L4_CTRL_L4DPM0_MASK) >> ENET_L3_L4_CFG_L3_L4_CTRL_L4DPM0_SHIFT)

/*
 * L4SPIM0 (RW)
 *
 * Layer 4 Source Port Inverse Match Enable
 * When set, this bit indicates that the Layer 4 Source Port number field is enabled for inverse matching.
 * When reset, this bit indicates that the Layer 4 Source Port number field is enabled for perfect matching.
 * This bit is valid and applicable only when Bit 18 (L4SPM0) is set high.
 */
#define ENET_L3_L4_CFG_L3_L4_CTRL_L4SPIM0_MASK (0x80000UL)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L4SPIM0_SHIFT (19U)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L4SPIM0_SET(x) (((uint32_t)(x) << ENET_L3_L4_CFG_L3_L4_CTRL_L4SPIM0_SHIFT) & ENET_L3_L4_CFG_L3_L4_CTRL_L4SPIM0_MASK)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L4SPIM0_GET(x) (((uint32_t)(x) & ENET_L3_L4_CFG_L3_L4_CTRL_L4SPIM0_MASK) >> ENET_L3_L4_CFG_L3_L4_CTRL_L4SPIM0_SHIFT)

/*
 * L4SPM0 (RW)
 *
 * Layer 4 Source Port Match Enable
 * When set, this bit indicates that the Layer 4 Source Port number field is enabled for matching. When reset, the MAC ignores the Layer 4 Source Port number field for matching.
 */
#define ENET_L3_L4_CFG_L3_L4_CTRL_L4SPM0_MASK (0x40000UL)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L4SPM0_SHIFT (18U)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L4SPM0_SET(x) (((uint32_t)(x) << ENET_L3_L4_CFG_L3_L4_CTRL_L4SPM0_SHIFT) & ENET_L3_L4_CFG_L3_L4_CTRL_L4SPM0_MASK)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L4SPM0_GET(x) (((uint32_t)(x) & ENET_L3_L4_CFG_L3_L4_CTRL_L4SPM0_MASK) >> ENET_L3_L4_CFG_L3_L4_CTRL_L4SPM0_SHIFT)

/*
 * L4PEN0 (RW)
 *
 * Layer 4 Protocol Enable
 * When set, this bit indicates that the Source and Destination Port number fields for UDP frames are used for matching.
 * When reset, this bit indicates that the Source and Destination Port number fields for TCP frames are used for matching.
 * The Layer 4 matching is done only when either L4SPM0 or L4DPM0 bit is set high.
 */
#define ENET_L3_L4_CFG_L3_L4_CTRL_L4PEN0_MASK (0x10000UL)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L4PEN0_SHIFT (16U)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L4PEN0_SET(x) (((uint32_t)(x) << ENET_L3_L4_CFG_L3_L4_CTRL_L4PEN0_SHIFT) & ENET_L3_L4_CFG_L3_L4_CTRL_L4PEN0_MASK)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L4PEN0_GET(x) (((uint32_t)(x) & ENET_L3_L4_CFG_L3_L4_CTRL_L4PEN0_MASK) >> ENET_L3_L4_CFG_L3_L4_CTRL_L4PEN0_SHIFT)

/*
 * L3HDBM0 (RW)
 *
 * Layer 3 IP DA Higher Bits Match
 *  IPv4 Frames: This field contains the number of higher bits of IP Destination Address that are matched in the IPv4 frames. The following list describes the values of this field:
 * - 0: No bits are masked.
 * - 1: LSb[0] is masked.
 * - 2: Two LSbs [1:0] are masked. - ...
 * - 31: All bits except MSb are masked. IPv6 Frames: Bits [12:11] of this field correspond to Bits [6:5] of L3HSBM0,
 * which indicate the number of lower bits of IP Source or Destination Address that are masked in the IPv6 frames.
 * The following list describes the concatenated values of the L3HDBM0[1:0] and L3HSBM0 bits:
 * - 0: No bits are masked.
 * - 1: LSb[0] is masked.
 * - 2: Two LSbs [1:0] are masked. - …
 * - 127: All bits except MSb are masked. This field is valid and applicable only if L3DAM0 or L3SAM0 is set high.
 */
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3HDBM0_MASK (0xF800U)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3HDBM0_SHIFT (11U)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3HDBM0_SET(x) (((uint32_t)(x) << ENET_L3_L4_CFG_L3_L4_CTRL_L3HDBM0_SHIFT) & ENET_L3_L4_CFG_L3_L4_CTRL_L3HDBM0_MASK)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3HDBM0_GET(x) (((uint32_t)(x) & ENET_L3_L4_CFG_L3_L4_CTRL_L3HDBM0_MASK) >> ENET_L3_L4_CFG_L3_L4_CTRL_L3HDBM0_SHIFT)

