hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_enet_regs.h
/*
 * L3HSBM0 (RW)
 *
 * Layer 3 IP SA Higher Bits Match
 *  IPv4 Frames: This field contains the number of lower bits of IP Source Address that are masked for matching in the IPv4 frames. The following list describes the values of this field:
 * - 0: No bits are masked.
 * - 1: LSb[0] is masked.
 * - 2: Two LSbs [1:0] are masked. - ...
 * - 31: All bits except MSb are masked. IPv6 Frames: This field contains Bits [4:0] of the field that indicates the number of higher bits of IP Source or Destination Address matched in the IPv6 frames.
 * This field is valid and applicable only if L3DAM0 or L3SAM0 is set high.
 */
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3HSBM0_MASK (0x7C0U)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3HSBM0_SHIFT (6U)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3HSBM0_SET(x) (((uint32_t)(x) << ENET_L3_L4_CFG_L3_L4_CTRL_L3HSBM0_SHIFT) & ENET_L3_L4_CFG_L3_L4_CTRL_L3HSBM0_MASK)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3HSBM0_GET(x) (((uint32_t)(x) & ENET_L3_L4_CFG_L3_L4_CTRL_L3HSBM0_MASK) >> ENET_L3_L4_CFG_L3_L4_CTRL_L3HSBM0_SHIFT)

/*
 * L3DAIM0 (RW)
 *
 * Layer 3 IP DA Inverse Match Enable
 * When set, this bit indicates that the Layer 3 IP Destination Address field is enabled for inverse matching.
 * When reset, this bit indicates that the Layer 3 IP Destination Address field is enabled for perfect matching. This bit is valid and applicable only when Bit 4 (L3DAM0) is set high.
 */
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3DAIM0_MASK (0x20U)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3DAIM0_SHIFT (5U)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3DAIM0_SET(x) (((uint32_t)(x) << ENET_L3_L4_CFG_L3_L4_CTRL_L3DAIM0_SHIFT) & ENET_L3_L4_CFG_L3_L4_CTRL_L3DAIM0_MASK)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3DAIM0_GET(x) (((uint32_t)(x) & ENET_L3_L4_CFG_L3_L4_CTRL_L3DAIM0_MASK) >> ENET_L3_L4_CFG_L3_L4_CTRL_L3DAIM0_SHIFT)

/*
 * L3DAM0 (RW)
 *
 * Layer 3 IP DA Match Enable
 * When set, this bit indicates that Layer 3 IP Destination Address field is enabled for matching. When reset, the MAC ignores the Layer 3 IP Destination Address field for matching.
 * Note: When Bit 0 (L3PEN0) is set, you should set either this bit or Bit 2 (L3SAM0) because either IPv6 DA or SA can be checked for filtering.
 */
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3DAM0_MASK (0x10U)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3DAM0_SHIFT (4U)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3DAM0_SET(x) (((uint32_t)(x) << ENET_L3_L4_CFG_L3_L4_CTRL_L3DAM0_SHIFT) & ENET_L3_L4_CFG_L3_L4_CTRL_L3DAM0_MASK)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3DAM0_GET(x) (((uint32_t)(x) & ENET_L3_L4_CFG_L3_L4_CTRL_L3DAM0_MASK) >> ENET_L3_L4_CFG_L3_L4_CTRL_L3DAM0_SHIFT)

/*
 * L3SAIM0 (RW)
 *
 * Layer 3 IP SA Inverse Match Enable
 * When set, this bit indicates that the Layer 3 IP Source Address field is enabled for inverse matching. When reset, this bit indicates that the Layer 3 IP Source Address field is enabled for perfect matching.
 * This bit is valid and applicable only when Bit 2 (L3SAM0) is set high.
 */
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3SAIM0_MASK (0x8U)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3SAIM0_SHIFT (3U)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3SAIM0_SET(x) (((uint32_t)(x) << ENET_L3_L4_CFG_L3_L4_CTRL_L3SAIM0_SHIFT) & ENET_L3_L4_CFG_L3_L4_CTRL_L3SAIM0_MASK)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3SAIM0_GET(x) (((uint32_t)(x) & ENET_L3_L4_CFG_L3_L4_CTRL_L3SAIM0_MASK) >> ENET_L3_L4_CFG_L3_L4_CTRL_L3SAIM0_SHIFT)

/*
 * L3SAM0 (RW)
 *
 * Layer 3 IP SA Match Enable
 * When set, this bit indicates that the Layer 3 IP Source Address field is enabled for matching. When reset, the MAC ignores the Layer 3 IP Source Address field for matching.
 */
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3SAM0_MASK (0x4U)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3SAM0_SHIFT (2U)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3SAM0_SET(x) (((uint32_t)(x) << ENET_L3_L4_CFG_L3_L4_CTRL_L3SAM0_SHIFT) & ENET_L3_L4_CFG_L3_L4_CTRL_L3SAM0_MASK)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3SAM0_GET(x) (((uint32_t)(x) & ENET_L3_L4_CFG_L3_L4_CTRL_L3SAM0_MASK) >> ENET_L3_L4_CFG_L3_L4_CTRL_L3SAM0_SHIFT)

/*
 * L3PEN0 (RW)
 *
 * Layer 3 Protocol Enable
 *  When set, this bit indicates that the Layer 3 IP Source or Destination Address matching is enabled for the IPv6 frames.
 * When reset, this bit indicates that the Layer 3 IP Source or Destination Address matching is enabled for the IPv4 frames.
 * The Layer 3 matching is done only when either L3SAM0 or L3DAM0 bit is set high.
 */
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3PEN0_MASK (0x1U)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3PEN0_SHIFT (0U)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3PEN0_SET(x) (((uint32_t)(x) << ENET_L3_L4_CFG_L3_L4_CTRL_L3PEN0_SHIFT) & ENET_L3_L4_CFG_L3_L4_CTRL_L3PEN0_MASK)
#define ENET_L3_L4_CFG_L3_L4_CTRL_L3PEN0_GET(x) (((uint32_t)(x) & ENET_L3_L4_CFG_L3_L4_CTRL_L3PEN0_MASK) >> ENET_L3_L4_CFG_L3_L4_CTRL_L3PEN0_SHIFT)

/* Bitfield definition for register of struct array L3_L4_CFG: L4_ADDR */
/*
 * L4DP0 (RW)
 *
 * Layer 4 Destination Port Number Field
 * When Bit 16 (L4PEN0) is reset and Bit 20 (L4DPM0) is set in Register 256 (Layer 3 and Layer 4 Control Register 0),
 * this field contains the value to be matched with the TCP Destination Port Number field in the IPv4 or IPv6 frames.
 * When Bit 16 (L4PEN0) and Bit 20 (L4DPM0) are set in Register 256 (Layer 3 and Layer 4 Control Register 0),
 * this field contains the value to be matched with the UDP Destination Port Number field in the IPv4 or IPv6 frames.
 */
#define ENET_L3_L4_CFG_L4_ADDR_L4DP0_MASK (0xFFFF0000UL)
#define ENET_L3_L4_CFG_L4_ADDR_L4DP0_SHIFT (16U)
#define ENET_L3_L4_CFG_L4_ADDR_L4DP0_SET(x) (((uint32_t)(x) << ENET_L3_L4_CFG_L4_ADDR_L4DP0_SHIFT) & ENET_L3_L4_CFG_L4_ADDR_L4DP0_MASK)
#define ENET_L3_L4_CFG_L4_ADDR_L4DP0_GET(x) (((uint32_t)(x) & ENET_L3_L4_CFG_L4_ADDR_L4DP0_MASK) >> ENET_L3_L4_CFG_L4_ADDR_L4DP0_SHIFT)

/*
 * L4SP0 (RW)
 *
 * Layer 4 Source Port Number Field
 *  When Bit 16 (L4PEN0) is reset and Bit 20 (L4DPM0) is set in Register 256 (Layer 3 and Layer 4 Control Register 0),
 *  this field contains the value to be matched with the TCP Source Port Number field in the IPv4 or IPv6 frames.
 * When Bit 16 (L4PEN0) and Bit 20 (L4DPM0) are set in Register 256 (Layer 3 and Layer 4 Control Register 0),
 * this field contains the value to be matched with the UDP Source Port Number field in the IPv4 or IPv6 frames.
 */
#define ENET_L3_L4_CFG_L4_ADDR_L4SP0_MASK (0xFFFFU)
#define ENET_L3_L4_CFG_L4_ADDR_L4SP0_SHIFT (0U)
#define ENET_L3_L4_CFG_L4_ADDR_L4SP0_SET(x) (((uint32_t)(x) << ENET_L3_L4_CFG_L4_ADDR_L4SP0_SHIFT) & ENET_L3_L4_CFG_L4_ADDR_L4SP0_MASK)
#define ENET_L3_L4_CFG_L4_ADDR_L4SP0_GET(x) (((uint32_t)(x) & ENET_L3_L4_CFG_L4_ADDR_L4SP0_MASK) >> ENET_L3_L4_CFG_L4_ADDR_L4SP0_SHIFT)

/* Bitfield definition for register of struct array L3_L4_CFG: L3_ADDR_0 */
/*
 * L3A00 (RW)
 *
 * Layer 3 Address 0 Field
 *  When Bit 0 (L3PEN0) and Bit 2 (L3SAM0) are set in Register 256 (Layer 3 and Layer 4 Control Register 0),
 * this field contains the value to be matched with Bits [31:0] of the IP Source Address field in the IPv6 frames.
 * When Bit 0 (L3PEN0) and Bit 4 (L3DAM0) are set in Register 256 (Layer 3 and Layer 4 Control Register 0),
 * this field contains the value to be matched with Bits [31:0] of the IP Destination Address field in the IPv6 frames.
 * When Bit 0 (L3PEN0) is reset and Bit 2 (L3SAM0) is set in Register 256 (Layer 3 and Layer 4 Control Register 0),
 * this field contains the value to be matched with the IP Source Address field in the IPv4 frames.
 */
#define ENET_L3_L4_CFG_L3_ADDR_0_L3A00_MASK (0xFFFFFFFFUL)
#define ENET_L3_L4_CFG_L3_ADDR_0_L3A00_SHIFT (0U)
#define ENET_L3_L4_CFG_L3_ADDR_0_L3A00_SET(x) (((uint32_t)(x) << ENET_L3_L4_CFG_L3_ADDR_0_L3A00_SHIFT) & ENET_L3_L4_CFG_L3_ADDR_0_L3A00_MASK)
#define ENET_L3_L4_CFG_L3_ADDR_0_L3A00_GET(x) (((uint32_t)(x) & ENET_L3_L4_CFG_L3_ADDR_0_L3A00_MASK) >> ENET_L3_L4_CFG_L3_ADDR_0_L3A00_SHIFT)

/* Bitfield definition for register of struct array L3_L4_CFG: L3_ADDR_1 */
/*
 * L3A10 (RW)
 *
 * Layer 3 Address 1 Field
 *  When Bit 0 (L3PEN0) and Bit 2 (L3SAM0) are set in Register 256 (Layer 3 and Layer 4 Control Register 0),
 * this field contains the value to be matched with Bits [63:32] of the IP Source Address field in the IPv6 frames.
 * When Bit 0 (L3PEN0) and Bit 4 (L3DAM0) are set in Register 256 (Layer 3 and Layer 4 Control Register 0),
 * this field contains the value to be matched with Bits [63:32] of the IP Destination Address field in the IPv6 frames.
 * When Bit 0 (L3PEN0) is reset and Bit 4 (L3DAM0) is set in Register 256 (Layer 3 and Layer 4 Control Register 0),
 *  this field contains the value to be matched with the IP Destination Address field in the IPv4 frames.
 */
#define ENET_L3_L4_CFG_L3_ADDR_1_L3A10_MASK (0xFFFFFFFFUL)
#define ENET_L3_L4_CFG_L3_ADDR_1_L3A10_SHIFT (0U)
#define ENET_L3_L4_CFG_L3_ADDR_1_L3A10_SET(x) (((uint32_t)(x) << ENET_L3_L4_CFG_L3_ADDR_1_L3A10_SHIFT) & ENET_L3_L4_CFG_L3_ADDR_1_L3A10_MASK)
#define ENET_L3_L4_CFG_L3_ADDR_1_L3A10_GET(x) (((uint32_t)(x) & ENET_L3_L4_CFG_L3_ADDR_1_L3A10_MASK) >> ENET_L3_L4_CFG_L3_ADDR_1_L3A10_SHIFT)

/* Bitfield definition for register of struct array L3_L4_CFG: L3_ADDR_2 */
/*
 * L3A20 (RW)
 *
 * Layer 3 Address 2 Field
 *  When Bit 0 (L3PEN0) and Bit 2 (L3SAM0) are set in Register 256 (Layer 3 and Layer 4 Control Register 0),
 * this field contains the value to be matched with Bits [95:64] of the IP Source Address field in the IPv6 frames.
 * When Bit 0 (L3PEN0) and Bit 4 (L3DAM0) are set in Register 256 (Layer 3 and Layer 4 Control Register 0),
 * this field contains value to be matched with Bits [95:64] of the IP Destination Address field in the IPv6 frames.
 * When Bit 0 (L3PEN0) is reset in Register 256 (Layer 3 and Layer 4 Control Register 0), this register is not used.
 */
#define ENET_L3_L4_CFG_L3_ADDR_2_L3A20_MASK (0xFFFFFFFFUL)
#define ENET_L3_L4_CFG_L3_ADDR_2_L3A20_SHIFT (0U)
#define ENET_L3_L4_CFG_L3_ADDR_2_L3A20_SET(x) (((uint32_t)(x) << ENET_L3_L4_CFG_L3_ADDR_2_L3A20_SHIFT) & ENET_L3_L4_CFG_L3_ADDR_2_L3A20_MASK)
#define ENET_L3_L4_CFG_L3_ADDR_2_L3A20_GET(x) (((uint32_t)(x) & ENET_L3_L4_CFG_L3_ADDR_2_L3A20_MASK) >> ENET_L3_L4_CFG_L3_ADDR_2_L3A20_SHIFT)

