hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_enet_regs.h
/*
 * RI (W1C)
 *
 * Receive Interrupt
 * This bit indicates that the frame reception is complete and the specific frame status information is updated in the descriptor.
 * The reception remains in the Running state.
 */
#define ENET_DMA_STATUS_RI_MASK (0x40U)
#define ENET_DMA_STATUS_RI_SHIFT (6U)
#define ENET_DMA_STATUS_RI_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_RI_SHIFT) & ENET_DMA_STATUS_RI_MASK)
#define ENET_DMA_STATUS_RI_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_RI_MASK) >> ENET_DMA_STATUS_RI_SHIFT)

/*
 * UNF (W1C)
 *
 * Transmit Underflow
 * This bit indicates that the Transmit Buffer had an Underflow during frame transmission. Transmission is suspended and an Underflow Error TDES0[1] is set.
 */
#define ENET_DMA_STATUS_UNF_MASK (0x20U)
#define ENET_DMA_STATUS_UNF_SHIFT (5U)
#define ENET_DMA_STATUS_UNF_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_UNF_SHIFT) & ENET_DMA_STATUS_UNF_MASK)
#define ENET_DMA_STATUS_UNF_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_UNF_MASK) >> ENET_DMA_STATUS_UNF_SHIFT)

/*
 * OVF (W1C)
 *
 * Receive Overflow
 * This bit indicates that the Receive Buffer had an Overflow during frame reception. If the partial frame is transferred to the application, the overflow status is set in RDES0[11].
 */
#define ENET_DMA_STATUS_OVF_MASK (0x10U)
#define ENET_DMA_STATUS_OVF_SHIFT (4U)
#define ENET_DMA_STATUS_OVF_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_OVF_SHIFT) & ENET_DMA_STATUS_OVF_MASK)
#define ENET_DMA_STATUS_OVF_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_OVF_MASK) >> ENET_DMA_STATUS_OVF_SHIFT)

/*
 * TJT (W1C)
 *
 * Transmit Jabber Timeout
 * This bit indicates that the Transmit Jabber Timer expired, which happens when the frame size exceeds 2,048 (10,240 bytes when the Jumbo frame is enabled).
 * When the Jabber Timeout occurs, the transmission process is aborted and placed in the Stopped state. This causes the Transmit Jabber Timeout TDES0[14] flag to assert.
 */
#define ENET_DMA_STATUS_TJT_MASK (0x8U)
#define ENET_DMA_STATUS_TJT_SHIFT (3U)
#define ENET_DMA_STATUS_TJT_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_TJT_SHIFT) & ENET_DMA_STATUS_TJT_MASK)
#define ENET_DMA_STATUS_TJT_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_TJT_MASK) >> ENET_DMA_STATUS_TJT_SHIFT)

/*
 * TU (W1C)
 *
 * Transmit Buffer Unavailable
 * This bit indicates that the host owns the Next Descriptor in the Transmit List and the DMA cannot acquire it. Transmission is suspended. Bits[22:20] explain the Transmit Process state transitions.
 * To resume processing Transmit descriptors, the host should change the ownership of the descriptor by setting TDES0[31] and then issue a Transmit Poll Demand command.
 */
#define ENET_DMA_STATUS_TU_MASK (0x4U)
#define ENET_DMA_STATUS_TU_SHIFT (2U)
#define ENET_DMA_STATUS_TU_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_TU_SHIFT) & ENET_DMA_STATUS_TU_MASK)
#define ENET_DMA_STATUS_TU_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_TU_MASK) >> ENET_DMA_STATUS_TU_SHIFT)

/*
 * TPS (W1C)
 *
 * Transmit Process Stopped
 * This bit is set when the transmission is stopped.
 */
#define ENET_DMA_STATUS_TPS_MASK (0x2U)
#define ENET_DMA_STATUS_TPS_SHIFT (1U)
#define ENET_DMA_STATUS_TPS_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_TPS_SHIFT) & ENET_DMA_STATUS_TPS_MASK)
#define ENET_DMA_STATUS_TPS_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_TPS_MASK) >> ENET_DMA_STATUS_TPS_SHIFT)

/*
 * TI (W1C)
 *
 * Transmit Interrupt
 * This bit indicates that the frame transmission is complete. When transmission is complete, Bit 31 (OWN) of TDES0 is reset, and the specific frame status information is updated in the descriptor.
 */
#define ENET_DMA_STATUS_TI_MASK (0x1U)
#define ENET_DMA_STATUS_TI_SHIFT (0U)
#define ENET_DMA_STATUS_TI_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_TI_SHIFT) & ENET_DMA_STATUS_TI_MASK)
#define ENET_DMA_STATUS_TI_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_TI_MASK) >> ENET_DMA_STATUS_TI_SHIFT)

/* Bitfield definition for register: DMA_OP_MODE */
/*
 * DT (RW)
 *
 * Disable Dropping of TCP/IP Checksum Error Frames
 * When this bit is set, the MAC does not drop the frames which only have errors detected by the Receive Checksum Offload engine.
 *  Such frames do not have any errors (including FCS error) in the Ethernet frame received by the MAC but have errors only in the encapsulated payload.
 * When this bit is reset, all error frames are dropped if the FEF bit is reset. If the IPC Full Checksum Offload Engine (Type 2) is disabled, this bit is reserved (RO with value 1'b0).
 */
#define ENET_DMA_OP_MODE_DT_MASK (0x10000000UL)
#define ENET_DMA_OP_MODE_DT_SHIFT (28U)
#define ENET_DMA_OP_MODE_DT_SET(x) (((uint32_t)(x) << ENET_DMA_OP_MODE_DT_SHIFT) & ENET_DMA_OP_MODE_DT_MASK)
#define ENET_DMA_OP_MODE_DT_GET(x) (((uint32_t)(x) & ENET_DMA_OP_MODE_DT_MASK) >> ENET_DMA_OP_MODE_DT_SHIFT)

/*
 * RSF (RW)
 *
 * Receive Store and Forward
 * When this bit is set, the MTL reads a frame from the Rx FIFO only after the complete frame has been written to it, ignoring the RTC bits.
 *  When this bit is reset, the Rx FIFO operates in the cut-through mode, subject to the threshold specified by the RTC bits.
 */
#define ENET_DMA_OP_MODE_RSF_MASK (0x2000000UL)
#define ENET_DMA_OP_MODE_RSF_SHIFT (25U)
#define ENET_DMA_OP_MODE_RSF_SET(x) (((uint32_t)(x) << ENET_DMA_OP_MODE_RSF_SHIFT) & ENET_DMA_OP_MODE_RSF_MASK)
#define ENET_DMA_OP_MODE_RSF_GET(x) (((uint32_t)(x) & ENET_DMA_OP_MODE_RSF_MASK) >> ENET_DMA_OP_MODE_RSF_SHIFT)

/*
 * DFF (RW)
 *
 * Disable Flushing of Received Frames
 * When this bit is set, the Rx DMA does not flush any frames because of the unavailability of receive descriptors or buffers as it does normally when this bit is reset. (See “Receive Process Suspended” on page 83.)
 */
#define ENET_DMA_OP_MODE_DFF_MASK (0x1000000UL)
#define ENET_DMA_OP_MODE_DFF_SHIFT (24U)
#define ENET_DMA_OP_MODE_DFF_SET(x) (((uint32_t)(x) << ENET_DMA_OP_MODE_DFF_SHIFT) & ENET_DMA_OP_MODE_DFF_MASK)
#define ENET_DMA_OP_MODE_DFF_GET(x) (((uint32_t)(x) & ENET_DMA_OP_MODE_DFF_MASK) >> ENET_DMA_OP_MODE_DFF_SHIFT)

/*
 * RFA_2 (RW)
 *
 * MSB of Threshold for Activating Flow Control
 * If the DWC_gmac is configured for an Rx FIFO size of 8 KB or more,
 * this bit (when set) provides additional threshold levels for activating the flow control in both half-duplex and full-duplex modes.
 * This bit (as Most Significant Bit), along with the RFA (Bits [10:9]), gives the following thresholds for activating flow control:
 * - 100: Full minus 5 KB, that is, FULL — 5 KB
 * - 101: Full minus 6 KB, that is, FULL — 6 KB
 * - 110: Full minus 7 KB, that is, FULL — 7 KB
 * - 111: Reserved This bit is reserved (and RO) if the Rx FIFO is 4 KB or less deep.
 */
#define ENET_DMA_OP_MODE_RFA_2_MASK (0x800000UL)
#define ENET_DMA_OP_MODE_RFA_2_SHIFT (23U)
#define ENET_DMA_OP_MODE_RFA_2_SET(x) (((uint32_t)(x) << ENET_DMA_OP_MODE_RFA_2_SHIFT) & ENET_DMA_OP_MODE_RFA_2_MASK)
#define ENET_DMA_OP_MODE_RFA_2_GET(x) (((uint32_t)(x) & ENET_DMA_OP_MODE_RFA_2_MASK) >> ENET_DMA_OP_MODE_RFA_2_SHIFT)

