hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_enet_regs.h
/*
 * RFD_2 (RW)
 *
 * MSB of Threshold for Deactivating Flow Control
 * If the DWC_gmac is configured for Rx FIFO size of 8 KB or more,
 *  this bit (when set) provides additional threshold levels for deactivating the flow control in both half-duplex and full-duplex modes.
 *  This bit (as Most Significant Bit) along with the RFD (Bits [12:11]) gives the following thresholds for deactivating flow control:
 * - 100: Full minus 5 KB, that is, FULL — 5 KB
 * - 101: Full minus 6 KB, that is, FULL — 6 KB
 * - 110: Full minus 7 KB, that is, FULL — 7 KB
 * - 111: Reserved This bit is reserved (and RO) if the Rx FIFO is 4 KB or less deep.
 */
#define ENET_DMA_OP_MODE_RFD_2_MASK (0x400000UL)
#define ENET_DMA_OP_MODE_RFD_2_SHIFT (22U)
#define ENET_DMA_OP_MODE_RFD_2_SET(x) (((uint32_t)(x) << ENET_DMA_OP_MODE_RFD_2_SHIFT) & ENET_DMA_OP_MODE_RFD_2_MASK)
#define ENET_DMA_OP_MODE_RFD_2_GET(x) (((uint32_t)(x) & ENET_DMA_OP_MODE_RFD_2_MASK) >> ENET_DMA_OP_MODE_RFD_2_SHIFT)

/*
 * TSF (RW)
 *
 * Transmit Store and Forward
 * When this bit is set, transmission starts when a full frame resides in the MTL Transmit FIFO.
 * When this bit is set, the TTC values specified in Bits [16:14] are ignored.
 * This bit should be changed only when the transmission is stopped.
 */
#define ENET_DMA_OP_MODE_TSF_MASK (0x200000UL)
#define ENET_DMA_OP_MODE_TSF_SHIFT (21U)
#define ENET_DMA_OP_MODE_TSF_SET(x) (((uint32_t)(x) << ENET_DMA_OP_MODE_TSF_SHIFT) & ENET_DMA_OP_MODE_TSF_MASK)
#define ENET_DMA_OP_MODE_TSF_GET(x) (((uint32_t)(x) & ENET_DMA_OP_MODE_TSF_MASK) >> ENET_DMA_OP_MODE_TSF_SHIFT)

/*
 * FTF (RW)
 *
 * Flush Transmit FIFO
 * When this bit is set, the transmit FIFO controller logic is reset to its default values and thus all data in the Tx FIFO is lost or flushed.
 * This bit is cleared internally when the flushing operation is complete.
 * The Operation Mode register should not be written to until this bit is cleared.
 * The data which is already accepted by the MAC transmitter is not flushed.
 * It is scheduled for transmission and results in underflow and runt frame transmission.
 */
#define ENET_DMA_OP_MODE_FTF_MASK (0x100000UL)
#define ENET_DMA_OP_MODE_FTF_SHIFT (20U)
#define ENET_DMA_OP_MODE_FTF_SET(x) (((uint32_t)(x) << ENET_DMA_OP_MODE_FTF_SHIFT) & ENET_DMA_OP_MODE_FTF_MASK)
#define ENET_DMA_OP_MODE_FTF_GET(x) (((uint32_t)(x) & ENET_DMA_OP_MODE_FTF_MASK) >> ENET_DMA_OP_MODE_FTF_SHIFT)

/*
 * TTC (RW)
 *
 * Transmit Threshold Control
 * These bits control the threshold level of the MTL Transmit FIFO.
 *  Transmission starts when the frame size within the MTL Transmit FIFO is larger than the threshold.
 * In addition, full frames with a length less than the threshold are also transmitted.
 *  These bits are used only when Bit 21 (TSF) is reset.
 * - 000: 64
 * - 001: 128
 * - 010: 192
 * - 011: 256
 * - 100: 40
 * - 101: 32
 * - 110: 24
 * - 111: 16
 */
#define ENET_DMA_OP_MODE_TTC_MASK (0x1C000UL)
#define ENET_DMA_OP_MODE_TTC_SHIFT (14U)
#define ENET_DMA_OP_MODE_TTC_SET(x) (((uint32_t)(x) << ENET_DMA_OP_MODE_TTC_SHIFT) & ENET_DMA_OP_MODE_TTC_MASK)
#define ENET_DMA_OP_MODE_TTC_GET(x) (((uint32_t)(x) & ENET_DMA_OP_MODE_TTC_MASK) >> ENET_DMA_OP_MODE_TTC_SHIFT)

/*
 * ST (RW)
 *
 * Start or Stop Transmission Command
 * When this bit is set, transmission is placed in the Running state, and the DMA checks the Transmit List at the current position for a frame to be transmitted.
 * Descriptor acquisition is attempted either from the current position in the list,
 * which is the Transmit List Base Address set by Register 4 (Transmit Descriptor List Address Register),
 * or from the position retained when transmission was stopped previously.
 *  If the DMA does not own the current descriptor,
 * transmission enters the Suspended state and Bit 2 (Transmit Buffer Unavailable) of Register 5 (Status Register) is set.
 * The Start Transmission command is effective only when transmission is stopped.
 * If the command is issued before setting Register 4 (Transmit Descriptor List Address Register),
 *  then the DMA behavior is unpredictable. When this bit is reset,
 * the transmission process is placed in the Stopped state after completing the transmission of the current frame.
 * The Next Descriptor position in the Transmit List is saved,
 * and it becomes the current position when transmission is restarted.
 * To change the list address, you need to program Register 4 (Transmit Descriptor List Address Register) with a new value when this bit is reset.
 * The new value is considered when this bit is set again.
 * The stop transmission command is effective only when the transmission of the current frame is complete or the transmission is in the Suspended state.
 */
#define ENET_DMA_OP_MODE_ST_MASK (0x2000U)
#define ENET_DMA_OP_MODE_ST_SHIFT (13U)
#define ENET_DMA_OP_MODE_ST_SET(x) (((uint32_t)(x) << ENET_DMA_OP_MODE_ST_SHIFT) & ENET_DMA_OP_MODE_ST_MASK)
#define ENET_DMA_OP_MODE_ST_GET(x) (((uint32_t)(x) & ENET_DMA_OP_MODE_ST_MASK) >> ENET_DMA_OP_MODE_ST_SHIFT)

/*
 * RFD (RW)
 *
 * Threshold for Deactivating Flow Control (in half-duplex and full-duplex modes) These bits control the threshold (Fill-level of Rx FIFO) at which the flow control is de-asserted after activation.
 * - 00: Full minus 1 KB, that is, FULL — 1 KB
 * - 01: Full minus 2 KB, that is, FULL — 2 KB
 * - 10: Full minus 3 KB, that is, FULL — 3 KB
 * - 11: Full minus 4 KB, that is, FULL — 4 KB
 * The de-assertion is effective only after flow control is asserted.
 *  If the Rx FIFO is 8 KB or more, an additional Bit (RFD_2) is used for more threshold levels as described in Bit 22.
 * These bits are reserved and read-only when the Rx FIFO depth is less than 4 KB.
 */
#define ENET_DMA_OP_MODE_RFD_MASK (0x1800U)
#define ENET_DMA_OP_MODE_RFD_SHIFT (11U)
#define ENET_DMA_OP_MODE_RFD_SET(x) (((uint32_t)(x) << ENET_DMA_OP_MODE_RFD_SHIFT) & ENET_DMA_OP_MODE_RFD_MASK)
#define ENET_DMA_OP_MODE_RFD_GET(x) (((uint32_t)(x) & ENET_DMA_OP_MODE_RFD_MASK) >> ENET_DMA_OP_MODE_RFD_SHIFT)

