hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_enet_regs.h
/*
 * ENET0_TXCLK_DLY_SEL (RW)
 *
 */
#define ENET_CTRL0_ENET0_TXCLK_DLY_SEL_MASK (0x3FU)
#define ENET_CTRL0_ENET0_TXCLK_DLY_SEL_SHIFT (0U)
#define ENET_CTRL0_ENET0_TXCLK_DLY_SEL_SET(x) (((uint32_t)(x) << ENET_CTRL0_ENET0_TXCLK_DLY_SEL_SHIFT) & ENET_CTRL0_ENET0_TXCLK_DLY_SEL_MASK)
#define ENET_CTRL0_ENET0_TXCLK_DLY_SEL_GET(x) (((uint32_t)(x) & ENET_CTRL0_ENET0_TXCLK_DLY_SEL_MASK) >> ENET_CTRL0_ENET0_TXCLK_DLY_SEL_SHIFT)

/* Bitfield definition for register: CTRL2 */
/*
 * ENET0_LPI_IRQ_EN (RW)
 *
 * lowpower interrupt enable, for internal use only, user should use core registers for enable/disable interrupt
 */
#define ENET_CTRL2_ENET0_LPI_IRQ_EN_MASK (0x20000000UL)
#define ENET_CTRL2_ENET0_LPI_IRQ_EN_SHIFT (29U)
#define ENET_CTRL2_ENET0_LPI_IRQ_EN_SET(x) (((uint32_t)(x) << ENET_CTRL2_ENET0_LPI_IRQ_EN_SHIFT) & ENET_CTRL2_ENET0_LPI_IRQ_EN_MASK)
#define ENET_CTRL2_ENET0_LPI_IRQ_EN_GET(x) (((uint32_t)(x) & ENET_CTRL2_ENET0_LPI_IRQ_EN_MASK) >> ENET_CTRL2_ENET0_LPI_IRQ_EN_SHIFT)

/*
 * ENET0_REFCLK_OE (RW)
 *
 * set to enable output 50MHz clock to rmii phy.
 * User should set it if use soc internal clock as refclk
 */
#define ENET_CTRL2_ENET0_REFCLK_OE_MASK (0x80000UL)
#define ENET_CTRL2_ENET0_REFCLK_OE_SHIFT (19U)
#define ENET_CTRL2_ENET0_REFCLK_OE_SET(x) (((uint32_t)(x) << ENET_CTRL2_ENET0_REFCLK_OE_SHIFT) & ENET_CTRL2_ENET0_REFCLK_OE_MASK)
#define ENET_CTRL2_ENET0_REFCLK_OE_GET(x) (((uint32_t)(x) & ENET_CTRL2_ENET0_REFCLK_OE_MASK) >> ENET_CTRL2_ENET0_REFCLK_OE_SHIFT)

/*
 * ENET0_PHY_INF_SEL (RW)
 *
 * PHY mode select
 * 000MII; 001RGMII; 100RMII;
 * should be set before config IOMUX, otherwise may cause glitch for RGMII
 */
#define ENET_CTRL2_ENET0_PHY_INF_SEL_MASK (0xE000U)
#define ENET_CTRL2_ENET0_PHY_INF_SEL_SHIFT (13U)
#define ENET_CTRL2_ENET0_PHY_INF_SEL_SET(x) (((uint32_t)(x) << ENET_CTRL2_ENET0_PHY_INF_SEL_SHIFT) & ENET_CTRL2_ENET0_PHY_INF_SEL_MASK)
#define ENET_CTRL2_ENET0_PHY_INF_SEL_GET(x) (((uint32_t)(x) & ENET_CTRL2_ENET0_PHY_INF_SEL_MASK) >> ENET_CTRL2_ENET0_PHY_INF_SEL_SHIFT)

/*
 * ENET0_FLOWCTRL (RW)
 *
 * flow control request
 */
#define ENET_CTRL2_ENET0_FLOWCTRL_MASK (0x1000U)
#define ENET_CTRL2_ENET0_FLOWCTRL_SHIFT (12U)
#define ENET_CTRL2_ENET0_FLOWCTRL_SET(x) (((uint32_t)(x) << ENET_CTRL2_ENET0_FLOWCTRL_SHIFT) & ENET_CTRL2_ENET0_FLOWCTRL_MASK)
#define ENET_CTRL2_ENET0_FLOWCTRL_GET(x) (((uint32_t)(x) & ENET_CTRL2_ENET0_FLOWCTRL_MASK) >> ENET_CTRL2_ENET0_FLOWCTRL_SHIFT)

/*
 * ENET0_RMII_TXCLK_SEL (RW)
 *
 * RMII mode output clock pad select
 * set to use txck as RMII refclk;
 * clr to use rxck as RMII refclk;  default 0(rxck)
 * refclk is always from pad, can use external clock from pad, or use internal clock output to pad then loopback.
 */
#define ENET_CTRL2_ENET0_RMII_TXCLK_SEL_MASK (0x400U)
#define ENET_CTRL2_ENET0_RMII_TXCLK_SEL_SHIFT (10U)
#define ENET_CTRL2_ENET0_RMII_TXCLK_SEL_SET(x) (((uint32_t)(x) << ENET_CTRL2_ENET0_RMII_TXCLK_SEL_SHIFT) & ENET_CTRL2_ENET0_RMII_TXCLK_SEL_MASK)
#define ENET_CTRL2_ENET0_RMII_TXCLK_SEL_GET(x) (((uint32_t)(x) & ENET_CTRL2_ENET0_RMII_TXCLK_SEL_MASK) >> ENET_CTRL2_ENET0_RMII_TXCLK_SEL_SHIFT)



/* MAC_ADDR register group index macro definition */
#define ENET_MAC_ADDR_1 (0UL)
#define ENET_MAC_ADDR_2 (1UL)
#define ENET_MAC_ADDR_3 (2UL)
#define ENET_MAC_ADDR_4 (3UL)

/* L3_L4_CFG register group index macro definition */
#define ENET_L3_L4_CFG_0 (0UL)

/* PPS register group index macro definition */
#define ENET_PPS_1 (0UL)
#define ENET_PPS_2 (1UL)
#define ENET_PPS_3 (2UL)


#endif /* HPM_ENET_H */
